amc
gme
even
corruption
jan
letting
shut
buy
orders
still
allow
tomorrow
great
day
keep
head
we
started
fun
yet
just
case
forgot
youre
apes
would
rather
see
bulgarian
boy
vlad
kenny
actually
defeated
you
thought
made
movie
talks
financialtreason
talking
market
makers
short
etfs
stop
bull
run
robinhood
setting
manipulate
hope
advantage
us
when
cant
rest
stonks
nakd
cringlekitten
really
think
every
one
hit
news
if
hyping
dates
make
use
liquidity
reason
thus
leaving
blind
dear
ryancohen
please
connect
ceoadam
discuss
guys
partner
near
future
stocks
history
always
go
good
know
sign
best
stock
alerts
link
stockmarket
pennystocks
willing
million
whatever
hiding
worth
trades
new
youtube
drop
watch
thanks
as
fuck
this
up
get
fucking
hyped
date
youve
manipulated
entire
life
the
tactics
fine
pic
read
secgov
retail
investor
months
going
feeling
tired
playing
exactly
books
ive
fight
eye
dont
let
red
days
upside
gavinmayreal
he
goes
guy
needs
google
ta
so
guess
getting
closed
national
say
things
top
video
games
gamestop
why
financial
content
constantly
either
channels
dip
average
ask
button
serious
problem
nothing
coming
little
work
they
created
diamond
rockstarstocks
how
feel
another
lets
part
taking
time
cover
covered
darkpoolabuse
shouldnt
litecoin
massive
cash
wallstreetbets
reddit
bitcoin
dogecoin
buying
opportunity
today
what
saw
show
power
hedge
funds
answer
garygensler
take
cvpayne
offer
interview
love
people
merger
nobody
smart
heard
esports
page
working
teaming
signed
for
never
give
die
selling
end
quarter
last
could
government
in
jhuntermav
told
wake
vladtenev
hey
might
want
change
name
company
something
business
need
pick
much
longer
bought
price
amcnotleaving
pokemon
build
amp
battle
kits
aka
olympics
theres
obvious
manipulation
hold
look
like
amcstock
earnings
volume
straight
long
hodl
win
im
hard
real
attack
shorts
shorted
only
complete
idiot
purchase
call
options
absolute
mean
god
damn
media
turned
sure
theyre
chance
soon
it
paid
friday
brokers
banks
margin
dark
americans
confidence
funny
mention
float
sold
times
bottom
broken
system
currently
yes
fantastic
everything
better
expected
partnering
amcsqueeze
sorry
gary
tried
trust
gave
set
put
broker
info
citadel
thank
channel
talk
potential
first
transparency
fair
markets
action
down
darkpools
tin
foil
hat
stopped
doesnt
repeat
often
mark
wall
street
tell
world
everyone
wondering
interest
seems
clear
arent
thing
anyone
losing
shares
step
fairness
pretty
gonna
next
shareholders
amcearningscall
revenue
woke
beautiful
fire
sale
help
broke
pissed
enemies
again
weird
to
repost
comment
section
blow
lot
sec
watching
crack
said
partnership
stream
gaming
events
door
open
person
charge
daily
darkpool
data
thoughts
secenforcement
blatant
pools
zionlion
kenangrace
hf
continues
but
move
positive
information
totally
legit
trading
looks
right
gets
live
nft
money
vote
melissaleecnbc
wanna
turn
network
pulled
enough
technical
analysis
buckle
political
ran
cleaning
fomo
apesnotleaving
gmearmy
apestrongtogether
unusualwhales
morning
waking
since
late
january
jacked
tf
mmat
level
clean
break
past
amazing
prepare
temporary
halt
replica
millions
folks
equity
seeing
premarket
pm
twitter
pumping
spend
shake
kill
its
weve
rate
accurate
many
come
gain
needed
wrinkles
true
thatneighborboy
play
yesterday
sell
have
essentially
crypto
ltc
hedgies
loading
while
jimmy
shill
putting
powder
save
dry
lfg
maskedinvestor
missing
man
backing
green
hood
all
moment
citsecurities
maybe
facts
without
throw
mailing
list
sneak
preview
opening
pages
moon
glad
amcshortsqueeze
looking
back
fucked
shit
done
extended
hopefully
together
forward
ceo
saying
plan
whole
way
around
are
moass
who
else
sleep
tonight
can
somebody
rub
sooth
brain
fidelity
pfof
now
month
double
public
lend
shorting
rich
reading
smooth
may
become
ever
mine
bit
gmesqueeze
questions
and
went
cause
my
accept
theatres
epic
doge
boom
from
holds
quite
narrative
hodlers
possible
collab
agree
alot
some
high
were
amctheatres
will
be
accepting
apple
pay
possibly
with
wont
patrickhaarlem
kongposting
rensole
haha
spaces
invite
fell
asleep
amcearningsday
companies
moving
slow
slowly
week
normal
okay
family
heres
got
bullish
fork
proves
listen
via
legend
gives
well
numbers
added
imagine
far
gamers
start
ryan
close
meeting
food
beverage
happy
excited
awesome
lending
naked
is
takes
team
amcgme
spread
word
bring
theaters
silver
screen
do
sit
greatest
wait
finally
says
here
amcarmy
huge
trying
consider
aint
surprise
happen
harder
ufc
gmes
webull
used
doing
fact
sheet
nice
beat
hours
interesting
meme
check
dog
rocket
knows
place
away
game
ms
yellen
conflict
dollar
relax
community
leg
remember
surge
roof
waiting
movement
over
low
share
robinhoodapp
notification
walk
cry
stepping
ur
making
three
fellow
heavy
corp
trade
at
on
biggest
july
ape
highly
recommend
speak
job
did
figure
gold
someone
their
taste
puts
looked
giving
calm
fuckers
update
strong
ftds
anything
year
following
report
seen
weeks
august
add
two
bb
eth
lol
almost
half
thewouston
asked
mattkohrs
thinking
wrong
bitch
borrow
pressure
does
matter
gcapestrategy
mind
keeps
jimcramer
online
ill
keeping
road
music
big
discount
monday
choose
anyway
synthetic
follow
position
runs
lose
inventory
lock
perfectly
after
gone
point
quick
cool
makes
sense
fud
restock
no
krhamblin
wish
scared
trending
dips
ready
bag
early
teachings
preparing
nakedshorts
avivhadar
shortdestroyer
everybody
account
showed
marxist
called
ass
obviously
couldnt
amount
fucks
left
given
welcome
whomever
sideways
tofiqfazl
appears
portfolio
took
profits
minute
mattswider
ok
training
prices
economy
access
earlier
email
fund
based
algorithm
bro
knowledge
shared
appreciate
weekend
came
literally
investments
means
maker
least
that
breaking
cock
wallstcynic
happened
second
full
important
congrats
dogearmy
holding
buddies
yeah
falling
chill
outside
speaking
explanation
night
knowing
crisis
wow
side
send
lead
btc
sampp
saturday
heads
bored
represents
group
lots
telegram
corrupt
there
ton
kicking
support
deep
zero
digging
hole
higher
using
return
plus
additional
confirm
attention
charts
less
interested
fired
tradespotting
institutions
bet
lost
stay
cheap
tendies
hedgefunds
pump
dump
didnt
correct
alright
phone
minutes
space
regulations
decides
single
catch
opened
msm
held
chances
caught
squeeze
mllenadjie
couple
thinks
dd
mr
joke
screenshot
ends
able
picked
deal
calling
communists
jim
bank
about
favorite
argument
hands
linkedin
investors
apearmy
fuckery
everyday
control
completely
strange
was
whats
not
illusion
marketmanipulation
etc
fundamentals
amcsayvote
darkpoolmanipulation
hoel
your
decide
per
usual
youtubers
major
then
heavily
learn
store
treyschair
problems
hfs
drops
stand
happens
perspective
strategy
regular
calls
thats
winning
whos
andrewrsorkin
america
free
fix
acting
happening
try
explain
situation
fraud
dumb
scoop
synthetics
fear
doubt
fed
aside
trillion
shfs
crayons
mouth
continue
raise
bs
cut
believe
native
mom
rat
bad
bets
pull
irrelevant
owl
write
jail
rh
friends
ahh
cramer
personally
cnbc
minds
oh
ticker
realized
traders
professionals
notice
sums
earnestly
adopted
leeroy
jenkins
find
choice
changed
small
passionate
fan
bases
reviewdork
must
drying
articles
reposting
removed
order
chat
mins
paper
hand
moved
id
comments
theyll
squawkcnbc
deleted
ken
griffin
hes
slgg
bounce
apestogetherstrong
customers
securities
lmao
amcapes
diamondhands
safe
party
bears
opinion
dirty
gensler
front
forget
aug
helps
solochicktravel
definitely
bullshit
clown
pushed
inflow
outflow
suspenddarkpools
og
hell
out
theory
dumps
forests
stupid
amd
vs
jesus
tesla
squeezing
care
already
these
jump
notleaving
rules
treasury
ryanrigg
da
til
also
contracts
bulls
stockstobuy
identical
crazy
averaging
special
est
vinwallstreet
young
feelings
anymore
sent
secenfdirector
simple
mm
covering
bell
noticed
trend
brought
hoping
protect
averaged
pro
largest
realize
debt
summer
ytd
vwap
kiss
limits
clue
baminvestor
management
years
reploudermilk
messed
voting
hearing
canceled
limited
supply
question
drive
join
billions
illegal
knew
current
meta
amcapee
piss
bots
turning
app
buys
likely
middle
war
understand
along
lowest
proof
crime
wonder
probably
empty
desperate
truth
smarter
weighing
block
sendansullivan
owned
candles
starts
country
shills
more
sells
hate
fake
ring
sum
ipo
rug
pulls
spreading
standing
because
difference
loaded
american
canada
fool
teyotigre
mevsmarket
opposite
helping
gmetothemoon
push
pt
convince
worry
twice
hear
bumpy
votes
benbain
pokeguy
reggie
benwehrman
shooting
clov
wkhs
crsr
soar
bloomberg
terminal
progress
ratio
load
tho
wtf
pop
gameinformer
fck
hazylifu
theater
nintendoamerica
mighty
tweets
protecting
idea
membership
somehow
restocks
bundles
youll
dumping
yall
gmeposhpug
meloniemac
easy
paulvigna
aspensecurity
citizenescobar
usharkbaitlol
thebullhouse
citadelair
divinererratic
kossifuenf
asonwally
honestly
dumped
billion