can
somebody
brain
needs
fidelity
doesnt
pfof
now
end
month
gme
time
double
ceoadam
cvpayne
for
real
amc
dogecoin
working
together
shit
day
one
know
think
teaming
hey
guys
make
public
saying
dont
lend
shares
shorting
fun
moment
call
tonight
to
amp
apes
what
rich
man
want
get
reading
moass
smooth
data
something
may
taking
look
the
longer
take
become
ever
give
mine
run
down
bit
stock
need
gmesqueeze
folks
answer
questions
please
hit
available
thank
and
stocks
went
cause
government
my
robinhood
it
money
up
next
accept
theatres
epic
doge
boom
from
back
video
still
holds
quite
narrative
hodlers
possible
collab
agree
alot
some
high
were
soon
amctheatres
will
be
accepting
apple
pay
google
bitcoin
amcnotleaving
possibly
with
rockstarstocks
wont
earnings
always
fucked
gonna
come
stockmarket
patrickhaarlem
kongposting
rensole
haha
fucking
swear
god
im
anyone
putting
spaces
invite
fell
asleep
woke
amcearningsday
all
companies
moving
slow
crypto
its
really
yet
price
slowly
go
week
nothing
new
see
sec
normal
market
okay
family
heres
got
lets
bullish
fork
proves
accurate
looking
citadel
listen
live
ta
via
youtube
this
legend
gives
news
gamestop
win
lot
actually
you
when
might
well
numbers
never
added
ftd
imagine
world
far
gamers
start
ryancohen
in
ryan
trust
close
short
last
set
meeting
business
pick
partnership
maybe
food
beverage
liquidity
happy
excited
awesome
much
yungbibba
thing
heard
read
secgov
secenforcement
garygensler
lending
naked
is
yes
takes
expected
damn
sure
team
lfg
amcgme
partner
spread
word
bring
gaming
theaters
let
put
games
silver
screen
turn
do
sit
greatest
so
wait
mean
finally
says
willing
events
here
we
apenation
amcarmy
huge
trying
consider
moon
cant
aint
surprise
wake
fantastic
glad
happen
buckle
opening
going
harder
ufc
movie
thatneighborboy
gmes
webull
page
used
trading
top
exactly
doing
fact
sheet
nice
sell
millions
goes
beat
hours
tomorrow
could
interesting
meme
check
pic
dog
bottom
rocket
blow
knows
little
place
like
away
letting
scroll
use
drop
stop
us
game
finishes
ms
yellen
step
conflict
interest
dollar
relax
community
leg
remember
surge
manipulation
roof
waiting
hood
movement
help
corruption
over
only
low
share
robinhoodapp
today
tf
notification
if
hedge
funds
without
walk
cry
stepping
ur
show
making
three
fellow
heavy
corp
trade
near
at
on
track
biggest
since
july
ape
highly
recommend
speak
ask
retail
investor
job
did
figure
days
gold
someone
their
taste
buying
puts
looked
good
kenny
confidence
giving
everyone
calm
fuck
financial
made
fuckers
update
started
strong
around
nobody
sold
shorts
attack
ftds
anything
year
following
work
talk
turned
bribery
report
volume
first
daily
seen
weeks
august
watch
analysis
add
two
bb
eth
link
sign
weird
constantly
lol
almost
half
million
thewouston
asked
mattkohrs
stream
said
love
thinking
wrong
why
bitch
borrow
pressure
mins
open
does
matter
positive
months
continues
gcapestrategy
mind
keeps
jimcramer
even
reddit
online
ill
thanks
keeping
they
road
amazing
music
forward
seeing
big
discount
opportunity
every
monday
morning
choose
anyway
enough
hope
synthetic
buy
trades
begin
follow
keep
premarket
level
resistance
sft
believe
position
runs
lose
everything
inventory
float
lock
just
perfectly
after
gone
point
quick
cash
saw
thought
cool
kinda
makes
sense
fud
play
feel
getting
considered
restock
no
krhamblin
wish
way
scared
trending
margin
dips
ready
bag
best
early
teachings
waking
preparing
stonks
darkpoolabuse
nakedshorts
avivhadar
shortdestroyer
everybody
another
twitter
account
showed
marxist
who
called
ass
obviously
stopped
theyre
couldnt
amount
fucks
left
building
given
welcome
whomever
sideways
cover
apesnotleaving
tofiqfazl
appears
portfolio
took
profits
known
minute
mattswider
ok
training
screenshots
prices
seems
risk
currently
economy
else
access
earlier
email
fund
based
algorithm
bro
knowledge
shared
appreciate
weekend
ive
came
literally
change
wondering
investments
person
means
needed
would
rest
maker
theres
least
that
jhuntermav
breaking
fight
cock
wallstcynic
happened
totally
though
second
part
full
important
information
amcsqueeze
congrats
dogearmy
holding
gamestops
clean
wall
street
buddies
yeah
falling
jimmy
chill
people
outside
speaking
kayenne
explanation
how
sleep
night
knowing
youre
crisis
wow
side
fire
send
lead
btc
stand
watching
coming
sale
sampp
great
spend
saturday
heads
bored
closed
right
youve
bearish
represents
group
lots
telegram
corrupt
system
there
ton
kicking
support
deep
zero
hedgies
digging
hole
higher
sometimes
worth
using
return
plus
additional
confirm
attention
charts
yesterday
as
less
interested
fired
tradespotting
mark
hf
shut
institutions
bet
lost
stay
cheap
tendies
tweet
of
was
dude
hedgefunds
pump
dump
didnt
correct
alright
but
phone
better
minutes
space
regulations
decides
single
smell
catch
opened
msm
held
many
chances
caught
squeeze
mllenadjie
while
couple
thinks
dd
mr
joke
green
wanna
screenshot
jacked
entire
ends
playing
history
bundle
able
picked
deal
list
preview
calling
communists
jim
bank
amcshortsqueeze
things
about
favorite
consoles
argument
hands
selling
linkedin
investors
apearmy
fuckery
shorted
everyday
control
january
completely
say
strange
either
post
whats
not
illusion
marketmanipulation
media
date
reason
break
etc
power
fundamentals
company
amcsayvote
darkpoolmanipulation
hodl
hoel
pokemon
your
somewhere
decide
per
usual
youtubers
major
then
whole
heavily
manipulated
tell
learn
store
treyschair
problems
hfs
drops
apestrongtogether
gary
weve
happens
perspective
strategy
regular
fcking
calls
thats
winning
whos
andrewrsorkin
america
free
fix
acting
happening
try
explain
situation
fraud
dumb
scoop
synthetics
arent
tactics
fear
doubt
fed
banks
aside
trillion
shfs
crayons
mouth
apestrong
obvious
continue
raise
bs
long
cut
citsecurities
problem
bought
native
mom
he
rat
pre
red
bad
bets
pull
irrelevant
owl
hold
write
vote
vlad
jail
rh
friends
ahh
cramer
personally
cnbc
clearly
channel
minds
oh
ticker
action
realized
traders
professionals
notice
thoughts
earnestly
adopted
leeroy
jenkins
find
hard
choice
manipulating
changed
small
passionate
fan
bases
reviewdork
must
drying
articles
reposting
interview
removed
order
absolute
chat
paper
hand
moved
looks
id
comments
funny
shitadel
theyll
squawkcnbc
deleted
ken
griffin
hes
slgg
brought
dangerous
bounce
apestogetherstrong
customers
securities
lmao
amcapes
diamondhands
safe
party
bears
opinion
thus
dirty
gensler
front
forget
markets
fair
melissaleecnbc
aug
options
helps
solochicktravel
definitely
kind
bullshit
clown
pushed
inflow
outflow
towards
wasnt
guess
suspenddarkpools
dark
pools
og
hell
out
theory
found
dumps
friday
forests
stupid
amd
vs
jesus
tesla
talking
squeezing
care
already
these
jump
notleaving
rules
darkpools
treasury
ryanrigg
da
forgot
til
also
broker
contracts
bulls
stockstobuy
pool
identical
crazy
dip
averaging
special
est
average
vinwallstreet
young
feelings
anymore
clear
sent
secenfdirector
simple
orders
mm
covering
bell
noticed
trend
hoping
protect
averaged
boy
pro
equity
largest
frustration
realize
debt
summer
ytd
vwap
kiss
limits
clue
baminvestor
pretty
management
leaving
sorry
losing
done
years
reploudermilk
messed
voting
hearing
canceled
limited
supply
question
charge
drive
join
are
created
billions
illegal
knew
throw
current
meta
pissed
amcapee
piss
bots
turning
plan
straight
app
instead
buys
likely
missing
battle
middle
war
understand
pass
along
lowest
proof
pumping
crime
wonder
stevie
probably
empty
desperate
truth
case
smarter
confident
cost
weighing
block
sendansullivan
owned
candles
upside
mms
starts
country
shills
dropping
more
sells
hate
fake
gets
ring
sum
ipo
rug
pulls
jan
spreading
vladtenev
ceo
standing
because
difference
guy
whatever
shake
loaded
american
canada
fool
teyotigre
mevsmarket
opposite
helping
gmetothemoon
hoods
push
financialtreason
pt
pulled
convince
alerts
worry
reach
twice
cringlekitten
hear
bumpy
votes
past
setting
hiding
unusualwhales
boys
benbain
pokeguy
reggie
merger
brokers
loading
benwehrman
shooting
however
ride
clov
wkhs
crsr
expect
soar
bloomberg
terminal
progress
rock
ratio
load
tho
wtf
pop
gameinformer
fck
knock
hazylifu
theater
nintendoamerica
mighty
tweets
hurry
fairness
protecting
idea
membership
xbox
somehow
restocks
bundles
members
youll
dumping
powerup
yall
gmeposhpug
meloniemac
asset
easy
paulvigna
aspensecurity
citizenescobar
theroaringkitty
usharkbaitlol
thebullhouse
citadelair
divinererratic
kossifuenf
asonwally
honestly
dumped
emoji
offer
our
congress
potential
emails
personal
yo
billion
actual
investment
grandkids
crash
coverage
plain
english
uncle
bruce
inflation